app/controllers/reports_controller.rb

  def index
  	@reports = Report.all
---
SELECT `reports`.* FROM `reports`

  def download
    @report_details = Report.find(params[:report_id]).report_details
---
SELECT "report_details".* FROM "report_details" WHERE "report_details"."report_id" = ?  [["report_id", 2]]
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", "2"]]

  def create
  	ps = `ps -eo pid,pgid,comm,user:20,pcpu,pmem`

    psarr = ps.split("\n")
    all_processes = Array.new

    for a in 1...psarr.length
      proc = Hash.new
      arr = psarr[a].split(" ")

      proc = {
        process_id: arr[0],
        process_group_id: arr[1],
        process_name: arr[2],
        process_user: arr[3],
        cpu_consumption: arr[4],
        mem_consumption: arr[5]
      }
      all_processes << proc
    end

    @report = Report.new(report_date: Time.now, report_user: "alaine", description: "testing testing")
    @report.report_details.build(all_processes)

    respond_to do |format|
      if @report.save
---
INSERT INTO `report_details` (`cpu_consumption`, `created_at`, `mem_consumption`, `process_group_id`, `process_id`, `process_name`, `process_user`, `report_id`, `updated_at`) VALUES ('0.0', '2016-06-11 10:20:34', '0.0', '1', '1', 'init', 'root', 1, '2016-06-11 10:20:34')
INSERT INTO `reports` (`created_at`, `description`, `report_date`, `report_user`, `updated_at`) VALUES ('2016-06-11 10:20:34', 'testing testing', '2016-06-11 10:20:34', 'alaine', '2016-06-11 10:20:34')

  def destroy
    rep = Report.find(5)
    rep.destroy
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "reports" WHERE "reports"."id" = ?  [["id", 1]]