app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT `users`.* FROM `users` ORDER BY `users`.name ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `name`, `password_digest`, `updated_at`) VALUES ('2016-06-12 15:06:23', 'alaine', '$2a$10$yaWuOFNGkPXdCX1ZfjJ1r.EORU.gqOnwWybYYS3pxeJYlxfoJWNQO', '2016-06-12 15:06:23')